# Pandas 101

In [3]:
import pandas as pd
import numpy as np
#import plotly.graph_objs as go
#from plotly.offline import download_plotlyjs, init_notebook_mode, plot, iplot
#init_notebook_mode(connected=True)

ImportError: Missing required dependencies ['numpy']

## pandas.DataFrame

In [ ]:
d = {'col1': [1, 2], 'col2': [3, 4]}
df = pd.DataFrame(data=d)
df

In [19]:
df.dtypes

col1    int64
col2    int64
dtype: object

In [20]:
df = pd.DataFrame(data=d, dtype=np.int8)

In [21]:
df.dtypes

col1    int8
col2    int8
dtype: object

In [22]:
df2 = pd.DataFrame(np.array([[1, 2, 3], [4, 5, 6], [7, 8, 9]]),
                   columns=['a', 'b', 'c'])
df2

   a  b  c
0  1  2  3
1  4  5  6
2  7  8  9

T	Transpose index and columns.
at	Access a single value for a row/column label pair.
axes	Return a list representing the axes of the DataFrame.
blocks	(DEPRECATED) Internal property, property synonym for as_blocks().
columns	The column labels of the DataFrame.
dtypes	Return the dtypes in the DataFrame.
empty	Indicator whether DataFrame is empty.
ftypes	Return the ftypes (indication of sparse/dense and dtype) in DataFrame.
iat	Access a single value for a row/column pair by integer position.
iloc	Purely integer-location based indexing for selection by position.
index	The index (row labels) of the DataFrame.
is_copy	Return the copy.
ix	A primarily label-location based indexer, with integer position fallback.
loc	Access a group of rows and columns by label(s) or a boolean array.
ndim	Return an int representing the number of axes / array dimensions.
shape	Return a tuple representing the dimensionality of the DataFrame.
size	Return an int representing the number of elements in this object.
style	Property returning a Styler object containing methods for building a styled HTML representation fo the DataFrame.
values	Return a Numpy representation of the DataFrame.
timetuple

In [23]:
df2.T

   0  1  2
a  1  4  7
b  2  5  8
c  3  6  9

In [24]:
df = pd.DataFrame([[0, 2, 3], [0, 4, 1], [10, 20, 30]],
                  index=[4, 5, 6], columns=['A', 'B', 'C'])
df

    A   B   C
4   0   2   3
5   0   4   1
6  10  20  30

`df.at`

In [25]:
df.at[4, 'B']

2

In [26]:
df = pd.DataFrame({'col1': [1, 2], 'col2': [3, 4]})
df

   col1  col2
0     1     3
1     2     4

In [27]:
df.axes

[RangeIndex(start=0, stop=2, step=1), Index(['col1', 'col2'], dtype='object')]

In [28]:
mydict = [{'a': 1, 'b': 2, 'c': 3, 'd': 4},
          {'a': 100, 'b': 200, 'c': 300, 'd': 400},
          {'a': 1000, 'b': 2000, 'c': 3000, 'd': 4000 }]
df = pd.DataFrame(mydict)
df

      a     b     c     d
0     1     2     3     4
1   100   200   300   400
2  1000  2000  3000  4000

In [19]:
subjects = ['Mathematics', 'English', 'History', 'CS', 'Arts', 'Biology', 'Chinese']
marks = [67, 60, 36, 61, 58, 99, 85]

In [20]:
marks_dataset = zip(subjects, marks)
marks_dataset

In [21]:
marks_df = pd.DataFrame(list(marks_dataset), columns=['Subjects', 'Marks'])
# zip cannot be used directly, you should give the result as a list
marks_df

      Subjects  Marks
0  Mathematics     67
1      English     60
2      History     36
3           CS     61
4         Arts     58
5      Biology     99
6      Chinese     85

The **columns** argument list represents the labels of the respective columns.

**Marks Distribution**

The following bar chart represents the marks distribution per subject.

In [22]:
marks_data = [go.Bar(x=marks_df.Subjects, y=marks_df.Marks)]

iplot({ 'data': marks_data,
            'layout': {
               'title': 'Marks Distribution',
               'xaxis': {
                 'title': 'Subjects'},
               'yaxis': {
                'title': 'Marks '}
        }})

Add a new column 'Result' using **numpy.where**, set it as 'Pass' if **marks>=40** else 'Fail'.

In [6]:
marks_df['Result'] = np.where(marks_df['Marks']>=40, 'Pass', 'Fail')
marks_df

      Subjects  Marks Result
0  Mathematics     67   Pass
1      English     60   Pass
2      History     36   Fail
3      Science     61   Pass
4         Arts     58   Pass

To delete a column (say 'Result'), we can use **`marks_df.pop('Result')`**.

In [4]:
df = pd.DataFrame({'A': [1, 1, 2, 2],
                   'B': [1, 2, 3, 4],
                   'C': np.random.randn(4)})

In [5]:
df

   A  B         C
0  1  1  1.048825
1  1  2 -2.376087
2  2  3 -0.568753
3  2  4 -0.208403

In [6]:
import seaborn as sns
planets = sns.load_dataset('planets')
planets.shape

(1035, 6)

In [7]:
planets.head()

            method  number  orbital_period   mass  distance  year
0  Radial Velocity       1         269.300   7.10     77.40  2006
1  Radial Velocity       1         874.774   2.21     56.95  2008
2  Radial Velocity       1         763.000   2.60     19.84  2011
3  Radial Velocity       1         326.030  19.40    110.62  2007
4  Radial Velocity       1         516.220  10.50    119.47  2009

In [8]:
rng = np.random.RandomState(42)
ser = pd.Series(rng.rand(5))
ser

0    0.374540
1    0.950714
2    0.731994
3    0.598658
4    0.156019
dtype: float64

In [9]:
df = pd.DataFrame({'key': ['A', 'B', 'C', 'A', 'B', 'C'],
                   'data': range(6)}, columns=['key', 'data'])
df

  key  data
0   A     0
1   B     1
2   C     2
3   A     3
4   B     4
5   C     5

In [10]:
df.groupby('key').sum()

     data
key
A       3
B       5
C       7

In [11]:
df.groupby('key').aggregate(['min', np.median, max])

    data
     min median max
key
A      0    1.5   3
B      1    2.5   4
C      2    3.5   5

In [14]:
df.groupby('key').aggregate(['min', np.median, max,count()])

NameError: name 'count' is not defined

In [11]:
import pandas as pd

df = pd.DataFrame({'A' : ['x','x','y','z','z'],
                   'B' : ['p','p','q','r','r']})
df

   A  B
0  x  p
1  x  p
2  y  q
3  z  r
4  z  r

In [12]:
df.groupby(['A','B']).size()

A  B
x  p    2
y  q    1
z  r    2
dtype: int64

In [13]:
df.groupby(['A','B']).B.agg('count')

A  B
x  p    2
y  q    1
z  r    2
Name: B, dtype: int64

In [14]:
df.groupby(['A','B']).B.agg('count').to_frame('c').reset_index()

   A  B  c
0  x  p  2
1  y  q  1
2  z  r  2

In [4]:
d={u'2012-06-08': [388,999],
 u'2012-06-09': [388,999],
 u'2012-06-10': [388,999],
 u'2012-07-06': [333,999]}
d

{'2012-06-08': [388, 999],
 '2012-06-09': [388, 999],
 '2012-06-10': [388, 999],
 '2012-07-06': [333, 999]}

In [15]:
pd.DataFrame.from_dict(d, orient='index',columns=['A','B'])

              A    B
2012-06-08  388  999
2012-06-09  388  999
2012-06-10  388  999
2012-07-06  333  999

In [16]:
pd.DataFrame.from_dict(d)

   2012-06-08  2012-06-09  2012-06-10  2012-07-06
0         388         388         388         333
1         999         999         999         999

## pandas.concat

## pandas.DataFrame.rank

In [3]:
file="/home/paperspace/data/kaggle/other_csv/top100.csv"
import pandas as pd
df=pd.read_csv(file,delimiter=",")
df.head()

                           Track Name            Artist  Position     Streams
0                        Shape of You        Ed Sheeran    301513  2993988783
1                   Despacito - Remix        Luis Fonsi    477232  1829621841
2  Despacito (Featuring Daddy Yankee)        Luis Fonsi    816152  1460802540
3            Something Just Like This  The Chainsmokers    725122  1386258295
4                             HUMBLE.    Kendrick Lamar    854060  1311243745

In [4]:
s = pd.DataFrame([['2012', 'A', 3], ['2012', 'B', 8], ['2011', 'A', 20], ['2011', 'B', 30]], columns=['Year', 'Manager', 'Return'])
s['Rank'] = s.groupby(['Year'])['Return'].rank(ascending=False)
print(s)

   Year Manager  Return  Rank
0  2012       A       3   2.0
1  2012       B       8   1.0
2  2011       A      20   2.0
3  2011       B      30   1.0